Tekla Open API Reference for Tekla Structures 2025
EdgeChamfer Constructor
Overload List
Name | Description
EdgeChamfer()
 Initializes a new instance of the EdgeChamfer class with empty attributes.
EdgeChamfer(Point, Point)
 Initializes a new instance of the EdgeChamfer class.
Top
See Also
Reference
EdgeChamfer Class
Tekla.Structures.Model Namespace